import re

text = """
Попри ці значущі зміни та зміцнення в устрої держави, після смерті Володимира Русь вступає у період міжусобної боротьби 
1015-1019 років.
Перемогу у протистоянні з братами здобув Ярослав Мудрий (1019–1054), який до 1036 року правив Руссю спільно з братом Мстиславом. 
Цей правитель остаточно розгромив печенігів, які здавна завдавали значної шкоди Київській Русі. й на тому місці збудував
у Києві Собор святої Софії, що стоїть донині. 
Впродовж 1037–1039 років було створено перший літописний звід, побудовано перші книжкові майстерні. Було засновано 
Києво-Печерську лавру, обрано київського митрополита Іларіона. 
Проведено судову реформу — запроваджено першу на Русі збірку законів — «Руська правда». 
На півдні він приєднав землі Поросся, на заході — ряд земель Польського королівства. 
Ярослав Мудрий широко застосовував шлюбну дипломатію, активно одружував дочок з європейськими правителями.
"""

info = '10 EUR, 20 EUR, 30 EUR - EURO EUROPE'

text_two = """
Історія України — історія земель сучасної України, українського народу та інших її мешканців,'
що проживають на території України, від доісторичних часів до сьогодення.
            """

periods = re.findall(r'\d{4}-\d{4}', text)
result = re.sub(r'\bEUR\b', 'USD', info)
words = re.split(r'\W+', text_two)

print(words)
print(periods)
print(result)
