"""
8. Задано дані (список списків) про багаж (кількість речей і загальна вага багажу) пасажирів.
Скласти функцію, яка повертає тапл де міститься:
а) кількість пасажирів, які мають більше двох речей;
б) чи є хоч один пасажир, багаж якого складається з однієї речі вагою менше 25 кг;
в) число пасажирів, кількість речей яких перевершує середнє число речей всіх пасажирів.

```python
[
    {'number_of_items': 3, 'total_weight': 30},
    {'number_of_items': 2, 'total_weight': 20},
    {'number_of_items': 1, 'total_weight': 15},
    # Додайте дані для ще пасажирів
]
```
"""


def baggage_analyses(total_info):
    pass


if __name__ == '__main__':
    pass
