"""
Задача 1
Напишіть программу "Касир в кінотеатрі", яка попросить користувача ввести свій вік
(можна використати константу або функцію input(), на екран має бути виведено лише одне повідомлення).
- якщо користувачу менше 7 - вивести повідомлення"Де твої батьки?"
- якщо користувачу менше 16 - вивести повідомлення "Це фільм для дорослих!"
- якщо від 16 до 65 то зробіть якесь вітальне повідомлення, на ваш розсуд.
- якщо користувачу більше 65 - вивести повідомлення"Покажіть пенсійне посвідчення!"
"""

# age = int(input('Введіть ваш вік: '))
# if age <= 7:
#     print("Де твої батьки?")
# elif age <= 16:
#     print("Це фільм для дорослих!")
# elif age >= 16 and age < 65:
#     print("Попкорн брати будете?")
# elif age > 65:
#     print("Покажіть пенсійне посвідчення!")

"""Задача 2

Текстова в чому різниця між is та ==?

== (оператор рівності) - Порівнює значення двох об'єктів.
is (оператор тотожності) - Використовується для перевірки того, 
чи об'єкти тотожні (вказують на один і той же об'єкт в пам'яті).

"""
"""
Задача 3

Напишіть програму яка в користувача запитує два числа(можуть бути числа типу інт, а можуть бути в стр). 
Потім запитує це стр чи інт і в залежності від відповіді конкатенує їх або додає і повертає результат 
перемножений на три. якщо після конкатенації отримали 10 то перемноживши на 3 отримаємо 30.
"""
num1 = input('Ведіть перше число: ')
num2 = input('Введіть друге число: ')

operation_type = input("Ви хочете використовувати конкатенацію чи додавання? (str/int): ")

if operation_type == "str":
    result = num1 + num2
elif operation_type == 'int':
    result = (int(num1) + int(num2)) * 3

print("Результат:", result)
