"""Задача 1
Напишіть програму яка запитує в користувача вартість покупок,
він їх вводе через пробіл, точна кількість не вказана.
Вам потрібно до вартості покупок додати 6,5 відсотки податків.

Потім питаєте чи є в користувача купон на знижку якщо є то питаєте це на суму чи на відсоток і потім віднімаєте суму
або відсоток відповідно від ціни яку отримали раніше і пишете користувачу кінцеву суму.

* завдання з зірочкою не впливає на бал. Округліть суму якщо копійок більше ніж 44 то це буде + 1 гривня,
якщо менше. то тоді просто відкидаємо копійки від ціни."""

# Запит користувача вартості покупок
purchase_cost = input('Введіть вартість ваших покупок через пробіл: ')
purchase_items = []

# Розділення введеної вартості покупок і обчислення загальної суми
split_purchase = purchase_cost.split()
for item in split_purchase:
    purchase_items.append(float(item))
total_cost = sum(purchase_items)

# Додавання податків до загальної суми
total_cost_with_tax = total_cost + 0.065 * total_cost
# Запит користувача про наявність купона на знижку
discount_coupon = input("Чи є у вас купон на знижку? (yes / no): ")
# Якщо є купон на знижку
if discount_coupon.lower() == 'yes':
    # Запит користувача про тип купона (сума чи відсоток)
    discount_type = input("Купон на знижку за сумою чи відсотком? (coupon / %): ")

    # Якщо купон на знижку за сумою
    if discount_type.lower() == 'coupon':
        discount_amount = float(input("Введіть суму знижки: "))
        print(f'Загальна сума зі знижкою: {total_cost_with_tax - discount_amount}')
    # Якщо купон на знижку відсотком
    elif discount_type.lower() == '%':
        discount_percent = float(input("Введіть відсоток знижки: "))
        discount = discount_percent / 100 * total_cost_with_tax
        print(f'Загальна сума зі знижкою: {total_cost_with_tax - discount}')
    else:
        print("Невірний тип купона.")
else:
    print(f'Загальна сума без знижки: {total_cost_with_tax}')

"""Задача 2
Переробіть задачу з попереднього уроку враховуючи ваші знання з цього уроку, використайте цикл for in або while.
"""

""" Чесно кажучи я довго думав над тією задачею щоб рішити без циклу.. але не догнав.. 
Тому вона була зроблена вже з циклами.
"""

"""Задача 3

Напишіть програму Банкомат. Втсановіть пін код для користувача(зробимо це константою). 
Запитайте в користувача Пін якщо він введе три рази не вірно то напишіть що карта заблокована. 
Використовуйте цикл while.
"""

USER_PIN_CODE = 0000
n = 3

while n > 0:
    check_pin = int(input("Введіть ваш пін для перевірки: "))

    if USER_PIN_CODE == check_pin:
        print("PIN вірний. Вхід дозволено.")
        break
    else:
        n -= 1
        print(f"Невірний PIN. Залишилося спроб: {n}")

if n == 0:
    print("Ви вичерпали всі спроби. Карта заблокована.")

"""Задача 4
Напишіть за допомогою f-string та format. Дві стрічки де буде підставлятись імя та вік з зміних
f_string = тут ваш код формата ф-стрінг. | повино вийти -> Я Олена, мені 21 рік
format_string = тут ваш код формата формат стрінг | повино вийти -> Я Олена, мені 21 рік
"""
name = "оЛенА"

age = 21

# print(f_string)
print(f'Я {name.title()}, мені {age} рік')
# print(format_string)
print('Я {0}, мені {1} рік'.format(name.title(), age))
